{"new_to_uk": ["Question: I just moved to the UK and have previous driving experience in my home country, what discounts can I avail as a newcomer?\nAnswer: As a newcomer to the UK, you can save up to 45% with instant experience-based discounts on all the years you’ve been driving, both in the UK and abroad. Furthermore, if you have a proven record of claim-free driving, you can avail extra discounts.", "Question: I just moved to the UK and I'm having a bit of trouble navigating the customer support options. Can you tell me what kind of support is available to me?\nAnswer: Customers can get help through Live Chat support open daily and a 24/7 phone line for claims and accident support.", "Question: How much were the total payouts for insurance claims from our company in 2022?\nAnswer: In 2022, our company paid out a total of £36 million in insurance claims.", "Question: I have recently purchased an insurance policy directly through an app. Is it possible for me to tweak and make changes to my policy details, payment plans, and coverage as I see fit? \nAnswer: Yes, as a customer, you can make unlimited changes to your details on the app when you buy direct, spread the cost with smaller monthly payments, and review your cover every year to only pay for what you need.", "Question: As a new resident in the UK, I recently bought an insurance plan. What extra features can I add to my current insurance plan to enhance my coverage? \nAnswer: Customers can add extra features to their plan such as breakdown cover, legal cover, discount protection and more.", "Question: Given that I've just purchased a new car insurance policy, what are my options for making my payments?\nAnswer: You can spread the cost of your policy across smaller monthly payments, choose a payment date that suits you, and get additional assistance if needed.", "Question: I've recently moved to the UK and purchased a car here. Can you guide me on how to prepare my car for driving in the UK? \nAnswer: Before driving, you need to register the car, pay the road tax, check the MOT, and get car insurance.", "Question: I've recently moved to the UK and want to start driving, could you tell me some of the basic road rules I should be aware of in the UK?\nAnswer: Of course, here are some basic rules: In the UK, you should drive on the left-hand side of the road. It is mandatory to wear a seatbelt while driving. Also, you should not use your phone while driving as it's against the law. The speed limit signs are indicated in miles, not kilometres, so keep that in mind while driving. If you see two yellow lines at the side of the road, it means parking is not allowed there.", "Question: I recently moved to the UK and I'm struggling to navigate the roundabouts. Can you guide me on how to use roundabouts in the UK?\n\nAnswer: Definitely. When you approach a roundabout in the UK, always slow down. You should give way to anything that's approaching from the right. Once the road is clear, proceed in a clockwise direction around the roundabout. Don't forget to indicate before you exit the roundabout."], "car_insurance": ["Question: I just downloaded an insurance app for my policy management, what features can I expect from this app?\nAnswer: With the app, you can manage your policy, access all your documents, and update your details on-the-go, at any time of day. You can also start a claim, start a Live Chat, and make changes to next year’s cover in seconds.", "Question: I've been involved in a car accident late at night, what can I do to report this incident immediately?\nAnswer: You can report the incident immediately to us via our 24/7 accident phone line. We’ll start working on your case right away. To help us serve you better, please provide as much information as you can, including the contact details of anyone else involved.", "Question: If I'm involved in an accident where the other driver is uninsured or my vehicle gets vandalized, how does my insurance policy cover me?\nAnswer: Your insurance policy will safeguard your claim-free driving discount and you will receive a full refund on the amount you paid for your initial claim, also known as your excess.", "Question: If I get involved in a car accident, what kind of insurance coverage can I expect?\nAnswer: We’ll cover damage to your car, and provide financial support for serious injuries. If someone else is involved, we’ll cover any damage to their car or property, and any injury compensation payouts.", "Question: My vehicle was stolen from the parking lot yesterday. What kind of coverage can I expect from my insurance? \nAnswer: We’ll cover you if your car is stolen, or damaged from vandalism, fire or attempted theft - up to the total value of your car.", "Question: My car has been taken in for repairs at your approved garage, will I be provided with a replacement vehicle? \nAnswer: As long as you use one of our approved repairers, we’ll do everything we can to get you a courtesy car while yours is in the garage. Subject to availability.", "Question: I was driving through a construction site last night and a stray pebble flew up and cracked my window. What steps should I take now? \nAnswer: Whether your window is chipped, cracked, or completely shattered, you will need to pay a small amount upfront and we will handle the cost of any necessary glass repairs or replacements.", "Question: I'm planning a three-month road trip around Europe, what kind of insurance coverage will I have during this period?\nAnswer: Your Europe Roaming Pass gives you Third–party Only cover for up to 90 days in a whole host of European countries. This covers damage to others, but not to you or your car.", "Question: If I'm planning a road trip across Europe, what kind of breakdown services can I expect from my insurance cover?\nAnswer: Choose from three breakdown plans, powered by the AA. Roadside assistance UK-wide recoveryEuropean cover.", "Question: If I find myself in a disagreement related to a road incident, what kind of assistance can I expect from my motor insurance?\nAnswer: You can expect to receive Motor Legal Protection from your motor insurance. This means you can get the upper-hand in any road-related dispute. Your insurance will cover any legal costs required to settle disputes or appeal motoring convictions.", "Question: If my car is stolen and can't be repaired, how can the Courtesy Car upgrade benefit me?\nAnswer: With the Courtesy Car upgrade, you can have a replacement car if your vehicle is stolen or cannot be repaired. This is an enhancement from the standard courtesy cover which only provides a replacement if your car can be fixed.", "Question: I drive a lot for work, and even though I'm a careful driver, I worry about the possibility of accidents. Can you explain a feature that allows me to maintain my claim-free record even if accidents occur?\nAnswer: Indeed, there is a feature called \"No Claims Discount Protection\". With this, even good drivers like you who make mistakes can make up to 2 claims a year without affecting your claim-free record. It helps to protect your well-earned discount.", "Question: I am planning to drive through Europe for more than 90 days, is there an option to extend my Third-party Only Cover to a Fully Comprehensive cover?\nAnswer: Yes, you can upgrade your standard Europe Roaming Pass which gives you Third-party Only cover in Europe for up to 90 days, to a Fully Comprehensive cover. This upgrade will cover injury and damages to you, as well as any other person involved.", "Question: I occasionally need to drive my friend's car, what insurance option should I consider?\nAnswer: You can consider the Driving Other Cars (Third-party Only) option. This option provides third-party cover to drive other privately-owned cars in the UK. However, it does not cover you to drive other cars in your own household. If you have regular access to another vehicle, you need to be listed as an additional driver on the owner’s own policy.", "Question: I have just bought a new car and I'm looking into different insurance policies. Can you explain what Fully Comprehensive insurance is? \n\nAnswer: Fully Comprehensive policies protect you, your car, and anyone else involved in an accident you cause (including their car or any other property). Third-party Only policies do not cover you or your car - just the other person’s. And even though Fully Comprehensive policies give you more cover, they’re often cheaper."], "van_insurance": ["Question: I am a handyman and often transport my work tools in my van. Could you explain what the Carriage of Own Goods cover is?\nAnswer: The Carriage of Own Goods cover is for those who carry work tools in their van, or other work-related items.", "Question: I have downloaded the insurance company's app, what functionalities does it provide?\nAnswer: The app allows you to manage your policy and access your documents on the go, at any time of day. You can also start a claim and speak to us on Live Chat.", "Question: Can you explain what the 24/7 claims line is for if I were to get into an accident and need to report it immediately?\nAnswer: The 24/7 claims line is a service where you can report any incidents, whether it's your fault or not, damage or no damage. They will ask you what happened and get started on your claim.", "Question: If my van was vandalised and I have a claim-free driving history, what benefits does the Fair play promises offer me?\nAnswer: The Fair play promises protect your claim-free driving discount and give you a full refund on what you pay for the claim (also called your excess) if your van's been vandalised.", "Question: I was involved in an accident and my van needs repairs. What service does my insurance provide in this situation?\nAnswer: The Courtesy car service provides you with a replacement car or a van while your van is being repaired, depending on availability.", "Question: I was in a minor car accident this morning. Could you help me understand what coverage I have under my insurance policy for this situation?\nAnswer: In case of an accident, the insurance will cover damage to your van, and provide financial support for serious injuries. If someone else is involved, it will cover any damage to their car or property and any injury compensation payouts.", "Question: What kind of insurance coverage do I have if my van gets stolen or suffers damage due to vandalism or fire?\nAnswer: If your van is stolen, or damaged from vandalism, fire or attempted theft, the insurance will cover up to the total value of your van.", "Question: If my van is currently undergoing repairs at an approved garage, what options do I have for transportation?\nAnswer: As long as you use one of the approved repairers, the insurance will do everything they can to get you a courtesy car (or van, if they can) while yours is in the garage. This is subject to availability.", "Question: My van's windows got smashed while parked at a construction site, how does the insurance handle this?\nAnswer: For damaged windows, whether they're chipped, cracked, or smashed, you pay a small amount upfront and the insurance will cover the rest of the repair or replacement costs.", "Question: I was in a collision with a driver who doesn't have insurance, what happens now?\nAnswer: If you're hit by an uninsured driver, the insurance will protect your claim-free driving discount and you'll get a full refund on the amount you pay on your initial claim (also called your excess).", "Question: I'm planning a road trip across Europe for three months, can you tell me about the Europe Roaming Pass and how it could be useful for me?\nAnswer: The Europe Roaming Pass gives you Third-party Only cover for up to 90 days in lots of European countries.", "Question: What services will I receive if my vehicle breaks down during a trip within the UK or Europe?\nAnswer: If your vehicle breaks down during a trip, you will receive three types of services under the Breakdown cover. These are: Roadside assistance, UK-wide recovery, and European cover. These services are powered by the AA.", "Situation: A man recently got into a minor car accident which resulted in a dispute over who was at fault. He has been summoned to court over this matter and is worried about the legal costs associated with it. He has a car insurance policy but is unsure if it covers any legal costs.\n\nQuestion: Does my car insurance policy cover any legal costs related to disputes or appealing motoring convictions?\n\nAnswer: If your policy includes the Motor Legal Protection, it will cover any legal costs required to settle disputes or to appeal motoring convictions.", "Question: I've just found out my van has been stolen, it's not worth much so I expect it to be written off. What does the Courtesy Car upgrade for theft and total loss cover in this situation?\nAnswer: The Courtesy Car upgrade for theft and total loss provides a replacement vehicle if your van is stolen or written off (when repairs cost more than your van is worth). Standard courtesy cover only applies to vans being repaired.", "Question: I've been maintaining a claim-free record for my van insurance, and I'm worried about losing my discount if I have to make a claim. What can I do to protect my No Claims Discount?\nAnswer: The No Claims Discount Protection allows you to make up to 2 claims a year without affecting your claim-free record and your well-earned discount.", "Question: I often travel to Europe for work and need an insurance upgrade that covers damages and injuries in case of an accident. What is the Europe Roaming Pass upgrade?\nAnswer: The Europe Roaming Pass upgrade allows you to upgrade to Fully Comprehensive cover in Europe for up to 90 days, which covers injury and damages to you, as well as any other person involved in an accident."], "claims": ["Question: I was involved in a minor car accident yesterday and I want to make a general claim with my insurance company. What information do I need to provide for this? \nAnswer: To make a claim you’ll need: Your policy number, Your registration plate, Any third party information, The damage to your vehicle.", "Question: I've been involved in a minor collision with another vehicle. I'm safe but my car is damaged and I need to make a claim. What number do I call to report this?\nAnswer: You can report this by calling our claims helpline number which is +44 800 060 8622.", "Question: I was on a road trip when suddenly my car broke down in the middle of nowhere. What information do I need to provide to report this breakdown?\nAnswer: To report a breakdown, you’ll need: Your policy number, Your registration plate, Location of your car.", "Question: I'm currently in the UK and my car just broke down, what is the helpline number I should call for assistance?\nAnswer: You should call 03300 413675 for assistance.", "Situation: While on a road trip through Europe, your car breaks down on a lonely highway in France. You are a policy holder with your insurance company and you have previously noted down the necessary helpline numbers. However, in the panic of the situation, you've forgotten the breakdown helpline number to call from the EU.\n\nQuestion: I'm stranded on a highway in France and my car has broken down, what is the helpline number I should call for assistance if I am in the EU?\n\nAnswer: If you are in the EU, the breakdown helpline number you should call is 00 800 42 43 24 44.", "Question: I recently purchased a new car and I can't remember if I added breakdown cover to my insurance policy. How can I verify this?\nAnswer: To check if you have breakdown cover, log in to your account."], "our_story": ["Question: What led to the establishment of Marshmallow? \nAnswer: Marshmallow was established after its founders observed the unfairness in insurance pricing for individuals relocating to the UK. They noticed that the industry had overlooked this large group and was not correctly pricing them.", "Question: I recently moved to the UK and I'm finding the car insurance rates quite high, how can Marshmallow assist me?\nAnswer: Marshmallow can assist you by providing a fairer deal on your car insurance. They achieve this by building their own technology, creating unique pricing and fraud models that cater to the experiences of newcomers like you. Additionally, they invest time in getting to know their customers on a deeper level.", "Question: Can you tell me about the success Marshmallow has achieved since its inception, especially in terms of policies sold, app downloads, and claims paid out?\nAnswer: Absolutely, Marshmallow has achieved significant success since its inception. To date, it has sold over 342,000 insurance policies and its app has been downloaded by more than 300,000 people. Additionally, the company has paid out a whopping £66m in claims. They've made such an impact that the Financial Times has named them the second-fastest growing company in Europe.", "Question: As an immigrant in the UK who feels unfairly treated by the current insurance pricing model, how can a company like Marshmallow support me?\nAnswer: Marshmallow's mission is to back the ones who step outside the norm. They work to provide fairer insurance pricing models for immigrants and other individuals who find themselves marginalized or unfairly treated by the traditional insurance industry.", "Question: Given that Marshmallow has been working diligently to bring fairness to insurance prices for UK newcomers, what is their future focus going forward? \nAnswer: Marshmallow's future focus is on helping the millions of marginalised customers out there who find themselves on a different path - either by choice or circumstance. They plan to learn about their experiences, and build their company around their needs.", "Situation: You've recently moved to the UK and are searching for car insurance options. You came across Marshmallow, a company that seems to focus on providing a fair deal to newcomers in the UK. You've read about their mission, the problems they target, and their achievements. Now, you're curious to know who the main individuals running this company are.\n\nQuestion: Can you tell me who the main figures in charge of Marshmallow are?\n \nAnswer: The main individuals leading Marshmallow are Alexander Kent-Braham (co-CEO), Oliver Kent-Braham (co-CEO), and David Goaté (chief architect).", "Situation: John, a software engineer recently moved to UK, came across an article about Marshmallow, a company that provides fairer insurance prices to newcomers in the UK. He was quite impressed with the company's mission and achievements. Seeing that the company aligns with his values and could potentially offer a great work environment, he was interested in joining the team. \n\nQuestion: How can John, the software engineer who recently moved to the UK, apply to join the Marshmallow team? \n\nAnswer: John can apply to join Marshmallow by checking out the job listings on their website and submitting an application for a suitable position."], "refer_a_friend": ["Question: I've discovered this fantastic new app and I'm eager to share it with my friends. How can I inform them about this?\nAnswer: You can send them a referral link straight from the app.", "Question: I referred a friend to your service through the app 9 weeks ago and he hasn't made a claim yet, when should I expect my £25 voucher?\nAnswer: Once your friend has been with us for 10 weeks without making a claim, we'll send each of you a £25 Amazon voucher.", "Question: If I consistently refer to my friends about your service, what kind of rewards can I expect to receive?\nAnswer: You will continually be rewarded! You have the potential to earn up to £75 worth of Amazon vouchers annually."]}